In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
numbers = randn(5, 4)

# DataFrame

In [4]:
# Shift + Tab
# data,index,columns
df = pd.DataFrame(numbers, ["A", "B", "C", "D", "E"], ["W", "X", "Y", "Z"])

In [5]:
# 5行×4列
numbers

array([[-0.65020367,  0.32884241, -1.49243402,  0.52274298],
       [ 0.49845975, -0.62185662, -0.17500803, -0.41332968],
       [-0.18159806,  1.97503046, -0.79264784, -0.07942021],
       [-1.22886791,  0.50562701, -0.46870646,  1.86513483],
       [ 0.21084847,  0.97851623,  0.28743547, -0.43221877]])

In [6]:
df

          W         X         Y         Z
A -0.650204  0.328842 -1.492434  0.522743
B  0.498460 -0.621857 -0.175008 -0.413330
C -0.181598  1.975030 -0.792648 -0.079420
D -1.228868  0.505627 -0.468706  1.865135
E  0.210848  0.978516  0.287435 -0.432219

In [7]:
type(df)

pandas.core.frame.DataFrame

# 列をselect

In [9]:
# W列をselect
df["W"]

A   -1.787160
B    2.295004
C   -0.452463
D   -1.317765
E    1.928975
Name: W, dtype: float64

In [10]:
# W,Zをselect
df[["W", "Z"]]

          W         Z
A -1.787160  0.468978
B  2.295004  1.546329
C -0.452463 -0.425093
D -1.317765  0.183269
E  1.928975 -0.276595

In [11]:
# 1列のことをSeriesと呼んでいる
type(df["W"])

pandas.core.series.Series

In [13]:
# 複数列になると、DataFrameになる
type(df[["W", "X"]])

pandas.core.frame.DataFrame

# 行をselect

In [65]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [69]:
df.loc["A"]

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [59]:
# 1行のこともSeriesと呼んでいる
type(df.loc["A"])

pandas.core.series.Series

In [71]:
# 行番号でSelectもできる
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

# 行・列をselect

In [73]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [74]:
# BのY
df.loc["B", "Y"]

0.16690463609281317

In [76]:
# AとBの、XとY
df.loc[["A","B"], ["X", "Y"]]

          X         Y
A  1.693723 -1.706086
B  0.390528  0.166905

# new column

In [45]:
df["new"] = df["W"] + df["Y"]

In [46]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

# drop column

In [47]:
# もとのdfからは消えていない
# axisは、0:row, 1:col
df.drop("new", axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [9]:
# axisを省略するとindex=newでdropしようとして、
# KeyError: "['new'] not found in axis" になる
# df.drop("new")

In [49]:
# もとのdfからも消す場合
# axisは、0:row, 1:col
df.drop("new", axis=1, inplace=True)

In [50]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# drop row

In [51]:
# axisは、0:row, 1:col
df.drop("E", axis=0, inplace=False)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

# shape

In [54]:
# (row, col)のtupleが返ってくる。なので、axisは、0:row, 1:col
df.shape

(5, 4)